<?php

/**
 * @desc  微信活动_专属标签
 * Class   WechatTagModule
 */
class WechatTagModule  extends  CommonModule {

	public $KeyID = 'TagID';
	public $TableName = 'wechat_tag';

	public $ManTag = array(
			'八块腹肌', '单身汪', '学富五车', '爷们', '银荡男', '抠脚大汉', '高富帅', '钻石男', '憨厚', '型男', '玻璃心', '经济适用男', '无所不能', '敢爱敢恨', '美男子',
			'会调情浪漫', '起床困难户', '潜力股', '各种宅', '努力加班', '工作狂', '有钱任性', '小鲜肉', '不要脸', '臭不要脸', '痞子', '无节操', '屌炸天', '屌丝', '老司机',
			'身体被掏空', '不装逼会死', '会撩妹', '高智商烧脑', '接地气', '大神', '神一般的男人', '坏银', '帅锅', '闷骚男', '吃瓜群众','内敛','衣冠禽兽','有洁癖','男神',
			'直男癌', '就一个zhi“帅”', '很Man', '暖男', '蓝颜知己', '又酷又帅', '超绅士', '欧巴', '大长腿', '可以养的小白脸', '处女座','富二代','霸道总裁','妹王','别人家的男朋友',
			'男友力爆棚', '旅行家', '千年好男人', '会做饭的男人', '人鱼线', '健身达人', '花心大萝卜', '神经大条', '心太软', '单细胞生物', '话唠','2B青年','美男子','小公举','超机车',
			'理工男', '高大魁梧', '为人低调', '颜值担当', '乐观又悲观', '细心体贴', '风流成性', '太会浪', '太自恋', '麦霸', '仪表不凡','倔得跟头牛','执着','纠结','阳光',
			'彬彬有礼', '眉清目秀', '气宇轩昂', '风度翩翩', '一表人才', '英俊潇洒', '玉树临风', '知识渊博',
	);
	public $MadamTag = array(
			'亭亭玉立','女神','无龄女','美魔女','熟女','海绵女','宅女','直女','善解人意','女汉纸','马大哈','磨人的小妖精','3分钟热度','温柔','善良','纠结症',
			'太八卦','粗枝大叶','萌萌哒','纯真','女神经','逗逼','爱做梦','腐女','污出新高度','人见人爱,花见花开','性感妩媚','很傻很天真','古灵精怪','女流氓','逆生长','小清新','无节操','懵逼',
			'会撩汉','主要看气质','真性情','吃货','上的了天下得了地','照片比本人好看','大家闺秀','亲和力十足','彪悍','买买买','有气质','知性','开心果','小可爱','爱冒险','窈窕淑女','秀色可餐','红颜知己',
			'花枝招展','楚楚动人','小鸟依人','冰雪聪明','婀娜多姿','优雅大方','静茹脱兔','清新脱俗','玻璃心','乐观开朗','活泼可爱','温柔端庄','多才多艺','傲娇不偿命','爱发嗲','会撒娇','任性','独立自信',
			'自拍狂','青春活力','心灵手巧','太害羞','接地气','白富美','大长腿','娆人','小妖精','女神','女神经','爱抽风','胸大腿长','二次元','神经衰弱','大波浪','美少女','人美心善',
			'女强人','小萝莉','我还是个宝宝','卡哇伊','御姐','强迫症','帅哥控','勤劳的小蜜蜂','文艺女青年','可以娶回家','时尚潮人','舞蹈家','暖宝宝','小棉袄','网红脸','傻白甜','大叔控','马甲线',
			'化妆达人','素颜也可以出门','心灵手巧','人美心善','适合当老婆','桃花太旺','魅力四射','旅行达人'
	);

	public function GetInfoer(){
		global $DB;
		$sql = 'SELECT * FROM wechat_tag GROUP BY UserID';
		return $DB->select($sql);
	}
}
?>